; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v1 ?v10)
             (pred_7 ?v6 ?v9)
             (pred_11 ?v1 ?v9)
             (pred_3 ?v8 ?v1 )
	     (pred_2 ?v1)
             (pred_10 ?v4)
             (pred_12 ?v6)
             (pred_8 ?v9)
             (pred_4 ?v1)
             (pred_9 ?v6)
             (pred_1 ?v1)
             (pred_6 ))



(:action op_2
:parameters (?v12 ?v3 ?v5 ?v13)
:precondition (and (pred_10 ?v12) (pred_10 ?v3) (pred_12 ?v5) (pred_8 ?v13)
          (pred_5 ?v12 ?v3) (pred_7 ?v5 ?v13)
                   (pred_11 ?v3 ?v13) (pred_2 ?v12) 
                   (pred_4 ?v3) (pred_9 ?v5))
:effect (and  (pred_1 ?v3) (not (pred_4 ?v3))))


(:action op_3
:parameters (?v12 ?v7)
:precondition (and (pred_10 ?v12) (pred_10 ?v7)
               (pred_2 ?v12) (pred_5 ?v12 ?v7) (pred_1 ?v7))
:effect (and (pred_2 ?v7) (not (pred_2 ?v12))))

(:action op_4
:parameters (?v12 ?v5)
:precondition (and (pred_10 ?v12) (pred_12 ?v5) 
                  (pred_2 ?v12) (pred_3 ?v5 ?v12) (pred_6 ))
:effect (and (pred_9 ?v5)
   (not (pred_3 ?v5 ?v12)) (not (pred_6 ))))


(:action op_1
:parameters (?v12 ?v11 ?v2)
:precondition (and (pred_10 ?v12) (pred_12 ?v11) (pred_12 ?v2)
                  (pred_2 ?v12) (pred_9 ?v2) (pred_3 ?v11 ?v12))
:effect (and (pred_9 ?v11) (pred_3 ?v2 ?v12)
        (not (pred_9 ?v2)) (not (pred_3 ?v11 ?v12))))

(:action op_5
:parameters (?v12 ?v5)
:precondition (and (pred_10 ?v12) (pred_12 ?v5) 
                  (pred_2 ?v12) (pred_9 ?v5))
:effect (and (pred_6 ) (pred_3 ?v5 ?v12) (not (pred_9 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_08 obj_26 obj_10 obj_22 obj_19 obj_23 obj_09 obj_11 obj_20 obj_04 obj_07 obj_15 obj_18 obj_06 obj_31 obj_16 obj_02 obj_05 obj_14 obj_03 obj_01 obj_12 obj_17 obj_29
    obj_25 obj_27 obj_21
    obj_13 obj_28 obj_24
    )

    (:init
       (pred_6)

       (pred_10 obj_30)
       (pred_10 obj_08)
       (pred_10 obj_26)
       (pred_10 obj_10)
       (pred_10 obj_22)
       (pred_10 obj_19)
       (pred_10 obj_23)
       (pred_10 obj_09)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_04)
       (pred_10 obj_07)
       (pred_10 obj_15)
       (pred_10 obj_18)
       (pred_10 obj_06)
       (pred_10 obj_31)
       (pred_10 obj_16)
       (pred_10 obj_02)
       (pred_10 obj_05)
       (pred_10 obj_14)
       (pred_10 obj_03)
       (pred_10 obj_01)
       (pred_10 obj_12)
       (pred_10 obj_17)
       (pred_10 obj_29)
       (pred_8 obj_25)
       (pred_8 obj_27)
       (pred_8 obj_21)
       (pred_12 obj_13)
       (pred_12 obj_28)
       (pred_12 obj_24)

       (pred_5 obj_30 obj_19)
       (pred_5 obj_30 obj_08)
       (pred_5 obj_08 obj_23)
       (pred_5 obj_08 obj_26)
       (pred_5 obj_08 obj_30)
       (pred_5 obj_26 obj_09)
       (pred_5 obj_26 obj_10)
       (pred_5 obj_26 obj_08)
       (pred_5 obj_10 obj_11)
       (pred_5 obj_10 obj_22)
       (pred_5 obj_10 obj_26)
       (pred_5 obj_22 obj_20)
       (pred_5 obj_22 obj_10)
       (pred_5 obj_19 obj_04)
       (pred_5 obj_19 obj_23)
       (pred_5 obj_19 obj_30)
       (pred_5 obj_23 obj_07)
       (pred_5 obj_23 obj_09)
       (pred_5 obj_23 obj_08)
       (pred_5 obj_23 obj_19)
       (pred_5 obj_09 obj_15)
       (pred_5 obj_09 obj_11)
       (pred_5 obj_09 obj_26)
       (pred_5 obj_09 obj_23)
       (pred_5 obj_11 obj_18)
       (pred_5 obj_11 obj_20)
       (pred_5 obj_11 obj_10)
       (pred_5 obj_11 obj_09)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_20 obj_22)
       (pred_5 obj_20 obj_11)
       (pred_5 obj_04 obj_31)
       (pred_5 obj_04 obj_07)
       (pred_5 obj_04 obj_19)
       (pred_5 obj_07 obj_16)
       (pred_5 obj_07 obj_15)
       (pred_5 obj_07 obj_23)
       (pred_5 obj_07 obj_04)
       (pred_5 obj_15 obj_02)
       (pred_5 obj_15 obj_18)
       (pred_5 obj_15 obj_09)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_18 obj_05)
       (pred_5 obj_18 obj_06)
       (pred_5 obj_18 obj_11)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_06 obj_14)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_06 obj_18)
       (pred_5 obj_31 obj_03)
       (pred_5 obj_31 obj_16)
       (pred_5 obj_31 obj_04)
       (pred_5 obj_16 obj_01)
       (pred_5 obj_16 obj_02)
       (pred_5 obj_16 obj_07)
       (pred_5 obj_16 obj_31)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_02 obj_15)
       (pred_5 obj_02 obj_16)
       (pred_5 obj_05 obj_17)
       (pred_5 obj_05 obj_14)
       (pred_5 obj_05 obj_18)
       (pred_5 obj_05 obj_02)
       (pred_5 obj_14 obj_29)
       (pred_5 obj_14 obj_06)
       (pred_5 obj_14 obj_05)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_03 obj_31)
       (pred_5 obj_01 obj_12)
       (pred_5 obj_01 obj_16)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_12 obj_01)
       (pred_5 obj_17 obj_29)
       (pred_5 obj_17 obj_05)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_29 obj_14)
       (pred_5 obj_29 obj_17)
       (pred_4 obj_12)
       (pred_4 obj_01)
       (pred_4 obj_23)
       (pred_11  obj_12 obj_25)
       (pred_11  obj_01 obj_27)
       (pred_11  obj_23 obj_21)
       (pred_1 obj_30)
       (pred_1 obj_08)
       (pred_1 obj_26)
       (pred_1 obj_10)
       (pred_1 obj_22)
       (pred_1 obj_19)
       (pred_1 obj_09)
       (pred_1 obj_11)
       (pred_1 obj_20)
       (pred_1 obj_04)
       (pred_1 obj_07)
       (pred_1 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_06)
       (pred_1 obj_31)
       (pred_1 obj_16)
       (pred_1 obj_02)
       (pred_1 obj_05)
       (pred_1 obj_14)
       (pred_1 obj_03)
       (pred_1 obj_17)
       (pred_1 obj_29)

       (pred_7  obj_13 obj_25)
       (pred_7  obj_28 obj_27)
       (pred_7  obj_24 obj_21)
       (pred_3 obj_13 obj_14)
       (pred_3 obj_28 obj_08)
       (pred_3 obj_24 obj_20)
       (pred_2 obj_07)
    )

    (:goal (and
       (pred_3 obj_13 obj_16)
       (pred_3 obj_24 obj_07)
    ))
(:constraints
  (always (not (pred_2 obj_15)))
)
)

; plan
1. (op_3 obj_07 obj_16)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_16)
   goals met: 0 of 2
2. (op_3 obj_16 obj_02)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_02)
   goals met: 0 of 2
3. (op_3 obj_02 obj_05)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_05)
   goals met: 0 of 2
4. (op_3 obj_05 obj_18)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_18)
   goals met: 0 of 2
5. (op_3 obj_18 obj_06)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_06)
   goals met: 0 of 2
6. (op_3 obj_06 obj_20)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_20)
   goals met: 0 of 2
7. (op_4 obj_20 obj_24)
   deleted: (pred_3 obj_24 obj_20) (pred_6)
   added: (pred_9 obj_24)
   goals met: 0 of 2
8. (op_3 obj_20 obj_06)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_06)
   goals met: 0 of 2
9. (op_3 obj_06 obj_14)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_14)
   goals met: 0 of 2
10. (op_1 obj_14 obj_13 obj_24)
   deleted: (pred_9 obj_24) (pred_3 obj_13 obj_14)
   added: (pred_9 obj_13) (pred_3 obj_24 obj_14)
   goals met: 0 of 2
11. (op_3 obj_14 obj_05)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_05)
   goals met: 0 of 2
12. (op_3 obj_05 obj_02)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_02)
   goals met: 0 of 2
13. (op_3 obj_02 obj_16)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_16)
   goals met: 0 of 2
14. (op_5 obj_16 obj_13)
   deleted: (pred_9 obj_13)
   added: (pred_6) (pred_3 obj_13 obj_16)
   goals met: 1 of 2
15. (op_3 obj_16 obj_02)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_02)
   goals met: 1 of 2
16. (op_3 obj_02 obj_05)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_05)
   goals met: 1 of 2
17. (op_3 obj_05 obj_14)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_14)
   goals met: 1 of 2
18. (op_4 obj_14 obj_24)
   deleted: (pred_3 obj_24 obj_14) (pred_6)
   added: (pred_9 obj_24)
   goals met: 1 of 2
19. (op_3 obj_14 obj_05)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_05)
   goals met: 1 of 2
20. (op_3 obj_05 obj_02)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_02)
   goals met: 1 of 2
21. (op_3 obj_02 obj_16)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_16)
   goals met: 1 of 2
22. (op_3 obj_16 obj_07)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_07)
   goals met: 1 of 2
23. (op_5 obj_07 obj_24)
   deleted: (pred_9 obj_24)
   added: (pred_6) (pred_3 obj_24 obj_07)
   goals met: 2 of 2
